update documents after resolving issue
